tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "michaeleisel/zld"
tap "universal-ctags/universal-ctags"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Rainbows and unicorns in your console!
brew "lolcat"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Cross-shell prompt for astronauts
brew "starship"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A faster version of ld, Apple's linker
brew "michaeleisel/zld/zld"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "font-meslo-lg-nerd-font"
# GPU-based terminal emulator
cask "kitty"
